set -l test_dir (dirname (status filename))
source $test_dir/../functions/cn2int.fish


@test "Complete: 一億二千三百四十五萬六千七百八十九" (cn2int 一億二千三百四十五萬六千七百八十九) = 123456789
@test "Complete: 二億三千四百五十六萬七千八百九十一" (cn2int 二億三千四百五十六萬七千八百九十一) = 234567891
@test "Complete: 九億八千七百六十五萬四千三百二十一" (cn2int 九億八千七百六十五萬四千三百二十一) = 987654321


@test "Complete: 一億一千一百一十一萬一千一百一十一" (cn2int 一億一千一百一十一萬一千一百一十一) = 111111111
@test "Complete: 二億二千二百二十二萬二千二百二十二" (cn2int 二億二千二百二十二萬二千二百二十二) = 222222222
@test "Complete: 五億五千五百五十五萬五千五百五十五" (cn2int 五億五千五百五十五萬五千五百五十五) = 555555555


@test "Complete: 一亿二千三百四十五万六千七百八十九" (cn2int 一亿二千三百四十五万六千七百八十九) = 123456789
@test "Complete: 二亿三千四百五十六万七千八百九十一" (cn2int 二亿三千四百五十六万七千八百九十一) = 234567891


@test "Complete: 壹億貳仟參佰肆拾伍萬陸仟柒佰捌拾玖" (cn2int 壹億貳仟參佰肆拾伍萬陸仟柒佰捌拾玖) = 123456789
@test "Complete: 貳億參仟肆佰伍拾陸萬柒仟捌佰玖拾壹" (cn2int 貳億參仟肆佰伍拾陸萬柒仟捌佰玖拾壹) = 234567891


@test "Complete: 壹億壹仟壹佰壹拾壹萬壹仟壹佰壹拾壹" (cn2int 壹億壹仟壹佰壹拾壹萬壹仟壹佰壹拾壹) = 111111111
@test "Complete: 貳億貳仟貳佰貳拾貳萬貳仟貳佰貳拾貳" (cn2int 貳億貳仟貳佰貳拾貳萬貳仟貳佰貳拾貳) = 222222222


@test "Complete: 壹亿貳仟參佰肆拾伍万陆仟柒佰捌拾玖" (cn2int 壹亿貳仟參佰肆拾伍万陆仟柒佰捌拾玖) = 123456789


@test "Complete: 贰億叁仟肆佰伍拾陆萬柒仟捌佰玖拾壹" (cn2int 贰億叁仟肆佰伍拾陆萬柒仟捌佰玖拾壹) = 234567891
@test "Complete: 叁億肆佰伍拾陆萬柒仟捌佰玖拾贰" (cn2int 叁億肆佰伍拾陆萬柒仟捌佰玖拾贰) = 304567892


@test "Complete: 贰亿叁仟肆佰伍拾陆万柒仟捌佰玖拾壹" (cn2int 贰亿叁仟肆佰伍拾陆万柒仟捌佰玖拾壹) = 234567891
